"""Файл с текстами кнопок клавиатур"""

CURRENT_VACANCIES = 'Вакансии'
PROJECTS = 'Проекты'

BACK = '🔙 Назад'
PROFILE = 'Профиль'
support = 'Тех поддержка'
TECHNICAL_SUPPORT = 'Техническая поддержка'

# INFORMATIONAL_PORTAL = 'Информационный портал «ProКарьеру»'
detailed = 'Подробнее'
to_project = 'К проекту'
menu = 'Главное меню'
LIST_CURRENT_VACANCIES = [('Практики ', 'Практ'),
                          ('Стажировки', ' Посмотреть стаж'),
                          ('Работа', 'Подобрать вакансии'),
                          # ('Автоматическая рассылка вакансий', 'Рассылка'),
                          ]


LIST_CANCEL = [('Сформировать новый запрос', 'Сформировать новый запрос'),
               ('Вернуться к выбору типа услуги', 'Вернуться к выбору типа услуги')
               ]

LIST_PRICTICES_DATE = [('Сентябрь — Январь', 'Сентябрь — Январь'),
                       ('Февраль — Май', 'Февраль — Май'),
                       ('Июнь — Август', 'Июнь — Август'),
                       ]

LIST_AUTOMATIC_DISTRIBUTION = [('Создать новую рассылку', 'Создать новую рассылку'),
                               ('Изменить  интервал  рассылки',
                                'Изменить интервал  рассылки'),
                               ('Отменить рассылку', 'Отменить рассылку'),
                               ]

CALENDAR_CAREER_EVENTS = 'Открыть календарь мероприятий'


LSTEP = {'y': 'год', 'm': 'месяц', 'd': 'день'}

LIST_MAILING = ['Каждую неделю', 'Каждые две недели', 'Каждый месяц']
RESPONSE = 'Откликнуться'
DETAILED = 'Подробнее'
DETAILED_PRAC = 'Подробнее пр'
BACK_MENU = 'Вернуться назад в меню'
BACK_VACANCIES = 'Вернуться назад в вакансии'
BACK_SPES = 'Вернуться назад в специализации'
BACK_FORM_TERM = 'Вернуться в формы'
BACK_LINK = 'Вернуться в меню ссылок'
